welcome_message = 'Добро пожаловать в DISTORTION Store.\n' \
                  'В этом боте вы можете купить понравившиеся вещи.\n\n' \
                  'По любым вопросам пишите в поддержку, либо в директ Instagram! '

request_inst = 'Здравствуйте, так как вы впервые зашли в бота, предлагаем вам ввести ссылку на свой Instagram (либо ' \
               'свой ник через @).\n' \
               'Нам будет проще с вами связаться в случае возникших вопросов. Вы также можете пропустить данный этап. '

